`Переменные:
1) let
2) var
3) const`
`Имя переменной должно содержать только буквы, цифры или символы $ и _.
Первый символ не должен быть цифрой.
`


`
Отличия use strict:
Можно создавать переменные простым присваиванием
`

`Типы переменных в js:
1) number
2) string
3) boolean
4) BigInt больше 2 в тепени 53 -1. создаём добавляя n в конце числа 
5) null(ссылка на несуществующий объект, ничего/пусто)
6) undefined (значение не было присвоено)
7) object
8) symbol - используется для создания уникальных идентификаторов в объектах
`

`Кроме обычных чисел, существуют так называемые «специальные числовые значения», которые относятся к этому типу данных: Infinity, -Infinity и NaN. Они тоже Number`

`
Модалки: alert, prompt, confirm
`

`
Преобразование типов: 


`